*** crates/mem-authz/src/audit.rs:176:27: replace != with == in AuditChain::open

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace != with == in AuditChain::open
@@ -168,17 +168,17 @@
         let mut expected_prev = [0u8; 32];
         for (i, line) in reader.lines().enumerate() {
             let line = line?;
             if line.trim().is_empty() {
                 continue;
             }
             let r: AuditRecord = serde_json::from_str(&line)
                 .map_err(|e| AuditError::Corrupt(format!("record {i} unparseable: {e}")))?;
-            if r.sequence != records.len() as u64 {
+            if r.sequence == /* ~ changed by cargo-mutants ~ */ records.len() as u64 {
                 return Err(AuditError::Corrupt(format!(
                     "sequence break at record {i}: expected {}, found {}",
                     records.len(),
                     r.sequence
                 )));
             }
             if r.prev_hash != expected_prev {
                 return Err(AuditError::Corrupt(format!("prev_hash break at sequence {}", r.sequence)));

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2752150) panicked at crates/mem-authz/src/audit.rs:436:41:
crash window accepted: Corrupt("sequence break at record 0: expected 0, found 0")

---- audit::tests::truncated_log_is_detected_on_open stdout ----

thread 'audit::tests::truncated_log_is_detected_on_open' (2752156) panicked at crates/mem-authz/src/audit.rs:388:23:
expected Truncated {3, 2}, got error: audit log corrupt: sequence break at record 0: expected 0, found 0

---- audit::tests::persists_resumes_and_continues_across_reopen stdout ----

thread 'audit::tests::persists_resumes_and_continues_across_reopen' (2752153) panicked at crates/mem-authz/src/audit.rs:357:49:
reopen: Corrupt("sequence break at record 0: expected 0, found 0")

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::persists_resumes_and_continues_across_reopen
    audit::tests::truncated_log_is_detected_on_open

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
