*** crates/mem-authz/src/audit.rs:204:21: replace > with < in AuditChain::open

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace > with < in AuditChain::open
@@ -196,17 +196,17 @@
         })?;
         let head: Head = serde_json::from_slice(&head_bytes)
             .map_err(|e| AuditError::Corrupt(format!("head sidecar unparseable: {e}")))?;
         let head_hash: [u8; 32] = hex::decode(&head.last_hash)
             .ok()
             .and_then(|v| v.try_into().ok())
             .ok_or_else(|| AuditError::Corrupt("head last_hash is not 32 hex bytes".into()))?;
 
-        if head.len > log_len {
+        if head.len < /* ~ changed by cargo-mutants ~ */ log_len {
             return Err(AuditError::Truncated { head: head.len, log: log_len });
         }
         if log_len > head.len + 1 {
             return Err(AuditError::Corrupt(format!(
                 "log holds {log_len} records but head commits to {} — more than one in-flight append",
                 head.len
             )));
         }

---- audit::tests::log_more_than_one_ahead_of_head_is_rejected stdout ----

thread 'audit::tests::log_more_than_one_ahead_of_head_is_rejected' (2754571) panicked at crates/mem-authz/src/audit.rs:457:9:
assertion failed: matches!(AuditChain::open(&path), Err(AuditError::Corrupt(_)))

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2754570) panicked at crates/mem-authz/src/audit.rs:436:41:
crash window accepted: Truncated { head: 2, log: 3 }

---- audit::tests::truncated_log_is_detected_on_open stdout ----

thread 'audit::tests::truncated_log_is_detected_on_open' (2754576) panicked at crates/mem-authz/src/audit.rs:213:75:
index out of bounds: the len is 2 but the index is 2

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::log_more_than_one_ahead_of_head_is_rejected
    audit::tests::truncated_log_is_detected_on_open

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
