*** crates/mem-authz/src/audit.rs:204:21: replace > with >= in AuditChain::open

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace > with >= in AuditChain::open
@@ -196,17 +196,17 @@
         })?;
         let head: Head = serde_json::from_slice(&head_bytes)
             .map_err(|e| AuditError::Corrupt(format!("head sidecar unparseable: {e}")))?;
         let head_hash: [u8; 32] = hex::decode(&head.last_hash)
             .ok()
             .and_then(|v| v.try_into().ok())
             .ok_or_else(|| AuditError::Corrupt("head last_hash is not 32 hex bytes".into()))?;
 
-        if head.len > log_len {
+        if head.len >= /* ~ changed by cargo-mutants ~ */ log_len {
             return Err(AuditError::Truncated { head: head.len, log: log_len });
         }
         if log_len > head.len + 1 {
             return Err(AuditError::Corrupt(format!(
                 "log holds {log_len} records but head commits to {} — more than one in-flight append",
                 head.len
             )));
         }

---- audit::tests::persists_resumes_and_continues_across_reopen stdout ----

thread 'audit::tests::persists_resumes_and_continues_across_reopen' (2756604) panicked at crates/mem-authz/src/audit.rs:357:49:
reopen: Truncated { head: 3, log: 3 }

failures:
    audit::tests::persists_resumes_and_continues_across_reopen

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
