*** crates/mem-authz/src/audit.rs:207:31: replace + with - in AuditChain::open

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace + with - in AuditChain::open
@@ -199,17 +199,17 @@
         let head_hash: [u8; 32] = hex::decode(&head.last_hash)
             .ok()
             .and_then(|v| v.try_into().ok())
             .ok_or_else(|| AuditError::Corrupt("head last_hash is not 32 hex bytes".into()))?;
 
         if head.len > log_len {
             return Err(AuditError::Truncated { head: head.len, log: log_len });
         }
-        if log_len > head.len + 1 {
+        if log_len > head.len - /* ~ changed by cargo-mutants ~ */ 1 {
             return Err(AuditError::Corrupt(format!(
                 "log holds {log_len} records but head commits to {} — more than one in-flight append",
                 head.len
             )));
         }
         let prefix_hash = if head.len == 0 { [0u8; 32] } else { hash_after[head.len as usize - 1] };
         if prefix_hash != head_hash {
             return Err(AuditError::Corrupt(format!(

---- audit::tests::persists_resumes_and_continues_across_reopen stdout ----

thread 'audit::tests::persists_resumes_and_continues_across_reopen' (2759388) panicked at crates/mem-authz/src/audit.rs:357:49:
reopen: Corrupt("log holds 3 records but head commits to 3 — more than one in-flight append")

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2759385) panicked at crates/mem-authz/src/audit.rs:436:41:
crash window accepted: Corrupt("log holds 3 records but head commits to 2 — more than one in-flight append")

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::persists_resumes_and_continues_across_reopen

test result: FAILED. 12 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
