*** crates/mem-authz/src/audit.rs:267:57: replace + with * in AuditChain::append

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace + with * in AuditChain::append
@@ -259,17 +259,17 @@
         };
         let hash = record_hash(&record);
         if let Some(sink) = &mut self.sink {
             let mut line = serde_json::to_vec(&record)
                 .map_err(|e| AuditError::Corrupt(format!("record serialize: {e}")))?;
             line.push(b'\n');
             sink.log.write_all(&line)?;
             sink.log.sync_data()?;
-            write_head(&sink.head_path, record.sequence + 1, &hash)?;
+            write_head(&sink.head_path, record.sequence * /* ~ changed by cargo-mutants ~ */ 1, &hash)?;
         }
         self.last_hash = hash;
         self.next_seq += 1;
         self.records.push(record);
         Ok(self.records.last().expect("just pushed"))
     }
 
     pub fn len(&self) -> usize {

---- audit::tests::persists_resumes_and_continues_across_reopen stdout ----

thread 'audit::tests::persists_resumes_and_continues_across_reopen' (2757230) panicked at crates/mem-authz/src/audit.rs:357:49:
reopen: Corrupt("head hash does not match the log at length 2")

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2757227) panicked at crates/mem-authz/src/audit.rs:436:41:
crash window accepted: Corrupt("log holds 3 records but head commits to 1 — more than one in-flight append")

---- audit::tests::truncated_log_is_detected_on_open stdout ----

thread 'audit::tests::truncated_log_is_detected_on_open' (2757233) panicked at crates/mem-authz/src/audit.rs:388:23:
expected Truncated {3, 2}, got error: audit log corrupt: head hash does not match the log at length 2

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::persists_resumes_and_continues_across_reopen
    audit::tests::truncated_log_is_detected_on_open

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
