*** crates/mem-authz/src/audit.rs:270:23: replace += with *= in AuditChain::append

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace += with *= in AuditChain::append
@@ -262,17 +262,17 @@
             let mut line = serde_json::to_vec(&record)
                 .map_err(|e| AuditError::Corrupt(format!("record serialize: {e}")))?;
             line.push(b'\n');
             sink.log.write_all(&line)?;
             sink.log.sync_data()?;
             write_head(&sink.head_path, record.sequence + 1, &hash)?;
         }
         self.last_hash = hash;
-        self.next_seq += 1;
+        self.next_seq *= /* ~ changed by cargo-mutants ~ */ 1;
         self.records.push(record);
         Ok(self.records.last().expect("just pushed"))
     }
 
     pub fn len(&self) -> usize {
         self.records.len()
     }

---- audit::tests::appends_and_verifies stdout ----

thread 'audit::tests::appends_and_verifies' (2755726) panicked at crates/mem-authz/src/audit.rs:330:9:
assertion `left == right` failed
  left: Err("sequence break at 0")
 right: Ok(3)

---- audit::tests::persists_resumes_and_continues_across_reopen stdout ----

thread 'audit::tests::persists_resumes_and_continues_across_reopen' (2755730) panicked at crates/mem-authz/src/audit.rs:357:49:
reopen: Corrupt("sequence break at record 1: expected 1, found 0")

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2755727) panicked at crates/mem-authz/src/audit.rs:436:41:
crash window accepted: Corrupt("sequence break at record 1: expected 1, found 0")

failures:
    audit::tests::appends_and_verifies
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::persists_resumes_and_continues_across_reopen
    audit::tests::truncated_log_is_detected_on_open

test result: FAILED. 10 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
