*** crates/mem-authz/src/audit.rs:291:27: replace != with == in AuditChain::verify_integrity

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace != with == in AuditChain::verify_integrity
@@ -283,17 +283,17 @@
     pub fn records(&self) -> &[AuditRecord] {
         &self.records
     }
 
     /// Re-walk the chain; returns the count or the sequence where linkage breaks.
     pub fn verify_integrity(&self) -> Result<u64, String> {
         let mut expected_prev = [0u8; 32];
         for (i, r) in self.records.iter().enumerate() {
-            if r.sequence != i as u64 {
+            if r.sequence == /* ~ changed by cargo-mutants ~ */ i as u64 {
                 return Err(format!("sequence break at {}", r.sequence));
             }
             if r.prev_hash != expected_prev {
                 return Err(format!("prev_hash break at sequence {}", r.sequence));
             }
             expected_prev = record_hash(r);
         }
         Ok(self.records.len() as u64)

---- audit::tests::appends_and_verifies stdout ----

thread 'audit::tests::appends_and_verifies' (2760821) panicked at crates/mem-authz/src/audit.rs:330:9:
assertion `left == right` failed
  left: Err("sequence break at 0")
 right: Ok(3)

---- audit::tests::persists_resumes_and_continues_across_reopen stdout ----

thread 'audit::tests::persists_resumes_and_continues_across_reopen' (2760825) panicked at crates/mem-authz/src/audit.rs:358:13:
assertion `left == right` failed
  left: Err("sequence break at 0")
 right: Ok(3)

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2760822) panicked at crates/mem-authz/src/audit.rs:437:9:
assertion `left == right` failed
  left: Err("sequence break at 0")
 right: Ok(3)

failures:
    audit::tests::appends_and_verifies
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::persists_resumes_and_continues_across_reopen

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
