*** crates/mem-authz/src/audit.rs:57:5: replace feed with ()

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace feed with ()
@@ -49,19 +49,17 @@
     Corrupt(String),
     /// The head sidecar commits to more records than the log holds — the log
     /// was truncated (or rolled back) behind the chain head.
     #[error("audit log truncated: head commits to {head} records but log holds {log}")]
     Truncated { head: u64, log: u64 },
 }
 
 fn feed(h: &mut blake3::Hasher, tag: u8, bytes: &[u8]) {
-    h.update(&[tag]);
-    h.update(&(bytes.len() as u64).to_le_bytes());
-    h.update(bytes);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// blake3 over the record's fields including `sequence` and `prev_hash`, so the
 /// chain linkage is part of each hash.
 pub fn record_hash(r: &AuditRecord) -> [u8; 32] {
     let mut h = blake3::Hasher::new();
     feed(&mut h, 0, b"mem-authz:audit:v1");
     feed(&mut h, 1, &r.sequence.to_le_bytes());

---- audit::tests::tampering_is_detected stdout ----

thread 'audit::tests::tampering_is_detected' (2752403) panicked at crates/mem-authz/src/audit.rs:340:9:
assertion failed: c.verify_integrity().is_err()

---- audit::tests::tampered_log_record_is_detected_on_open stdout ----

thread 'audit::tests::tampered_log_record_is_detected_on_open' (2752402) panicked at crates/mem-authz/src/audit.rs:404:9:
assertion failed: matches!(AuditChain::open(&path), Err(AuditError::Corrupt(_)))

failures:
    audit::tests::tampered_log_record_is_detected_on_open
    audit::tests::tampering_is_detected

test result: FAILED. 12 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
