*** crates/mem-authz/src/audit.rs:92:5: replace head_path_for -> PathBuf with Default::default()

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace head_path_for -> PathBuf with Default::default()
@@ -84,19 +84,17 @@
 /// Write-through sink: the append-only JSONL log + the head sidecar paths.
 struct FileSink {
     log: File,
     log_path: PathBuf,
     head_path: PathBuf,
 }
 
 fn head_path_for(log_path: &Path) -> PathBuf {
-    let mut s = log_path.as_os_str().to_os_string();
-    s.push(".head");
-    PathBuf::from(s)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Atomically replace the head sidecar (write temp, fsync, rename).
 fn write_head(head_path: &Path, len: u64, last_hash: &[u8; 32]) -> Result<(), AuditError> {
     let tmp = {
         let mut s = head_path.as_os_str().to_os_string();
         s.push(".tmp");
         PathBuf::from(s)

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2756030) panicked at crates/mem-authz/src/audit.rs:426:49:
open: Io(Os { code: 2, kind: NotFound, message: "No such file or directory" })

---- audit::tests::log_more_than_one_ahead_of_head_is_rejected stdout ----

thread 'audit::tests::log_more_than_one_ahead_of_head_is_rejected' (2756031) panicked at crates/mem-authz/src/audit.rs:448:49:
open: Io(Os { code: 2, kind: NotFound, message: "No such file or directory" })

---- audit::tests::tampered_log_record_is_detected_on_open stdout ----

thread 'audit::tests::tampered_log_record_is_detected_on_open' (2756034) panicked at crates/mem-authz/src/audit.rs:396:49:
open: Io(Os { code: 2, kind: NotFound, message: "No such file or directory" })

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::log_more_than_one_ahead_of_head_is_rejected
    audit::tests::missing_head_sidecar_is_detected_on_open
    audit::tests::persists_resumes_and_continues_across_reopen
    audit::tests::tampered_log_record_is_detected_on_open
    audit::tests::truncated_log_is_detected_on_open

test result: FAILED. 8 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
