*** crates/mem-authz/src/audit.rs:99:5: replace write_head -> Result<(), AuditError> with Ok(())

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace write_head -> Result<(), AuditError> with Ok(())
@@ -91,28 +91,17 @@
 fn head_path_for(log_path: &Path) -> PathBuf {
     let mut s = log_path.as_os_str().to_os_string();
     s.push(".head");
     PathBuf::from(s)
 }
 
 /// Atomically replace the head sidecar (write temp, fsync, rename).
 fn write_head(head_path: &Path, len: u64, last_hash: &[u8; 32]) -> Result<(), AuditError> {
-    let tmp = {
-        let mut s = head_path.as_os_str().to_os_string();
-        s.push(".tmp");
-        PathBuf::from(s)
-    };
-    let payload = serde_json::to_vec(&Head { len, last_hash: hex::encode(last_hash) })
-        .map_err(|e| AuditError::Corrupt(format!("head serialize: {e}")))?;
-    let mut f = File::create(&tmp)?;
-    f.write_all(&payload)?;
-    f.sync_all()?;
-    std::fs::rename(&tmp, head_path)?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Default)]
 pub struct AuditChain {
     records: Vec<AuditRecord>,
     last_hash: [u8; 32],
     next_seq: u64,
     /// `None` → in-memory only (tests/ephemeral); `Some` → write-through.

---- audit::tests::missing_head_sidecar_is_detected_on_open stdout ----

thread 'audit::tests::missing_head_sidecar_is_detected_on_open' (2759945) panicked at crates/mem-authz/src/audit.rs:406:52:
remove head: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- audit::tests::log_more_than_one_ahead_of_head_is_rejected stdout ----

thread 'audit::tests::log_more_than_one_ahead_of_head_is_rejected' (2759944) panicked at crates/mem-authz/src/audit.rs:441:46:
snapshot head: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2759943) panicked at crates/mem-authz/src/audit.rs:420:46:
snapshot head: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::log_more_than_one_ahead_of_head_is_rejected
    audit::tests::missing_head_sidecar_is_detected_on_open
    audit::tests::persists_resumes_and_continues_across_reopen
    audit::tests::truncated_log_is_detected_on_open

test result: FAILED. 9 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
