*** crates/mem-authz/src/audit.rs:142:9: replace AuditChain::open -> Result<Self, AuditError> with Ok(Default::default())

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace AuditChain::open -> Result<Self, AuditError> with Ok(Default::default())
@@ -134,107 +134,17 @@
     /// - head sidecar missing/unparseable while the log has records →
     ///   [`AuditError::Corrupt`].
     ///
     /// Crash tolerance: an append fsyncs the log line before replacing the
     /// head, so a crash in between leaves the log exactly one record ahead of
     /// the head. That state is accepted and the head is repaired; anything
     /// further ahead is rejected.
     pub fn open(log_path: impl AsRef<Path>) -> Result<Self, AuditError> {
-        let log_path = log_path.as_ref().to_path_buf();
-        let head_path = head_path_for(&log_path);
-
-        // Fresh chain: create both files up front so the head sidecar always
-        // exists once the chain does (a missing head is then evidence, not noise).
-        if !log_path.exists() {
-            if let Some(parent) = log_path.parent() {
-                if !parent.as_os_str().is_empty() {
-                    std::fs::create_dir_all(parent)?;
-                }
-            }
-            let log = OpenOptions::new().create_new(true).append(true).open(&log_path)?;
-            write_head(&head_path, 0, &[0u8; 32])?;
-            return Ok(Self {
-                records: Vec::new(),
-                last_hash: [0u8; 32],
-                next_seq: 0,
-                sink: Some(FileSink { log, log_path, head_path }),
-            });
-        }
-
-        // Load + re-walk the chain, keeping the running hash after each record
-        // so the head's commitment can be checked at its own length.
-        let reader = BufReader::new(File::open(&log_path)?);
-        let mut records: Vec<AuditRecord> = Vec::new();
-        let mut hash_after: Vec<[u8; 32]> = Vec::new();
-        let mut expected_prev = [0u8; 32];
-        for (i, line) in reader.lines().enumerate() {
-            let line = line?;
-            if line.trim().is_empty() {
-                continue;
-            }
-            let r: AuditRecord = serde_json::from_str(&line)
-                .map_err(|e| AuditError::Corrupt(format!("record {i} unparseable: {e}")))?;
-            if r.sequence != records.len() as u64 {
-                return Err(AuditError::Corrupt(format!(
-                    "sequence break at record {i}: expected {}, found {}",
-                    records.len(),
-                    r.sequence
-                )));
-            }
-            if r.prev_hash != expected_prev {
-                return Err(AuditError::Corrupt(format!("prev_hash break at sequence {}", r.sequence)));
-            }
-            expected_prev = record_hash(&r);
-            hash_after.push(expected_prev);
-            records.push(r);
-        }
-        let log_len = records.len() as u64;
-        let last_hash = expected_prev;
-
-        // The head sidecar must exist and commit to a verified prefix.
-        let head_bytes = std::fs::read(&head_path).map_err(|e| {
-            AuditError::Corrupt(format!("head sidecar missing/unreadable ({e}) — possible tamper"))
-        })?;
-        let head: Head = serde_json::from_slice(&head_bytes)
-            .map_err(|e| AuditError::Corrupt(format!("head sidecar unparseable: {e}")))?;
-        let head_hash: [u8; 32] = hex::decode(&head.last_hash)
-            .ok()
-            .and_then(|v| v.try_into().ok())
-            .ok_or_else(|| AuditError::Corrupt("head last_hash is not 32 hex bytes".into()))?;
-
-        if head.len > log_len {
-            return Err(AuditError::Truncated { head: head.len, log: log_len });
-        }
-        if log_len > head.len + 1 {
-            return Err(AuditError::Corrupt(format!(
-                "log holds {log_len} records but head commits to {} — more than one in-flight append",
-                head.len
-            )));
-        }
-        let prefix_hash = if head.len == 0 { [0u8; 32] } else { hash_after[head.len as usize - 1] };
-        if prefix_hash != head_hash {
-            return Err(AuditError::Corrupt(format!(
-                "head hash does not match the log at length {}",
-                head.len
-            )));
-        }
-
-        // Repair the head after an accepted crash window.
-        if head.len != log_len {
-            write_head(&head_path, log_len, &last_hash)?;
-        }
-
-        let log = OpenOptions::new().append(true).open(&log_path)?;
-        Ok(Self {
-            records,
-            last_hash,
-            next_seq: log_len,
-            sink: Some(FileSink { log, log_path, head_path }),
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Path of the backing log, when persistent.
     pub fn log_path(&self) -> Option<&Path> {
         self.sink.as_ref().map(|s| s.log_path.as_path())
     }
 
     /// Append a record. For a persistent chain the record is durably written

---- audit::tests::open_creates_missing_parent_directory stdout ----

thread 'audit::tests::open_creates_missing_parent_directory' (2776640) panicked at crates/mem-authz/src/audit.rs:412:9:
open must create the missing parent directory

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2776635) panicked at crates/mem-authz/src/audit.rs:341:46:
snapshot head: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- audit::tests::log_more_than_one_ahead_of_head_is_rejected stdout ----

thread 'audit::tests::log_more_than_one_ahead_of_head_is_rejected' (2776637) panicked at crates/mem-authz/src/audit.rs:362:46:
snapshot head: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::log_more_than_one_ahead_of_head_is_rejected
    audit::tests::log_path_is_some_for_persistent_and_none_for_in_memory
    audit::tests::missing_head_sidecar_is_detected_on_open
    audit::tests::open_creates_missing_parent_directory
    audit::tests::persists_resumes_and_continues_across_reopen
    audit::tests::tampered_log_record_is_detected_on_open
    audit::tests::truncated_log_is_detected_on_open

test result: FAILED. 9 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
