*** crates/mem-authz/src/audit.rs:147:12: delete ! in AuditChain::open

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ delete ! in AuditChain::open
@@ -139,17 +139,17 @@
     /// the head. That state is accepted and the head is repaired; anything
     /// further ahead is rejected.
     pub fn open(log_path: impl AsRef<Path>) -> Result<Self, AuditError> {
         let log_path = log_path.as_ref().to_path_buf();
         let head_path = head_path_for(&log_path);
 
         // Fresh chain: create both files up front so the head sidecar always
         // exists once the chain does (a missing head is then evidence, not noise).
-        if !log_path.exists() {
+        if  /* ~ changed by cargo-mutants ~ */log_path.exists() {
             if let Some(parent) = log_path.parent() {
                 if !parent.as_os_str().is_empty() {
                     std::fs::create_dir_all(parent)?;
                 }
             }
             let log = OpenOptions::new().create_new(true).append(true).open(&log_path)?;
             write_head(&head_path, 0, &[0u8; 32])?;
             return Ok(Self {

---- audit::tests::log_more_than_one_ahead_of_head_is_rejected stdout ----

thread 'audit::tests::log_more_than_one_ahead_of_head_is_rejected' (2775489) panicked at crates/mem-authz/src/audit.rs:450:49:
open: Io(Os { code: 2, kind: NotFound, message: "No such file or directory" })

---- audit::tests::truncated_log_is_detected_on_open stdout ----

thread 'audit::tests::truncated_log_is_detected_on_open' (2775496) panicked at crates/mem-authz/src/audit.rs:377:49:
open: Io(Os { code: 2, kind: NotFound, message: "No such file or directory" })

---- audit::tests::open_creates_missing_parent_directory stdout ----

thread 'audit::tests::open_creates_missing_parent_directory' (2775492) panicked at crates/mem-authz/src/audit.rs:501:45:
open creates the parent dir: Io(Os { code: 2, kind: NotFound, message: "No such file or directory" })

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::log_more_than_one_ahead_of_head_is_rejected
    audit::tests::log_path_is_some_for_persistent_and_none_for_in_memory
    audit::tests::missing_head_sidecar_is_detected_on_open
    audit::tests::open_creates_missing_parent_directory
    audit::tests::persists_resumes_and_continues_across_reopen
    audit::tests::tampered_log_record_is_detected_on_open
    audit::tests::truncated_log_is_detected_on_open

test result: FAILED. 9 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
