*** crates/mem-authz/src/audit.rs:149:20: delete ! in AuditChain::open

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ delete ! in AuditChain::open
@@ -141,17 +141,17 @@
     pub fn open(log_path: impl AsRef<Path>) -> Result<Self, AuditError> {
         let log_path = log_path.as_ref().to_path_buf();
         let head_path = head_path_for(&log_path);
 
         // Fresh chain: create both files up front so the head sidecar always
         // exists once the chain does (a missing head is then evidence, not noise).
         if !log_path.exists() {
             if let Some(parent) = log_path.parent() {
-                if !parent.as_os_str().is_empty() {
+                if  /* ~ changed by cargo-mutants ~ */parent.as_os_str().is_empty() {
                     std::fs::create_dir_all(parent)?;
                 }
             }
             let log = OpenOptions::new().create_new(true).append(true).open(&log_path)?;
             write_head(&head_path, 0, &[0u8; 32])?;
             return Ok(Self {
                 records: Vec::new(),
                 last_hash: [0u8; 32],

---- audit::tests::open_creates_missing_parent_directory stdout ----

thread 'audit::tests::open_creates_missing_parent_directory' (2778492) panicked at crates/mem-authz/src/audit.rs:501:45:
open creates the parent dir: Io(Os { code: 2, kind: NotFound, message: "No such file or directory" })

failures:
    audit::tests::open_creates_missing_parent_directory

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
