*** crates/mem-authz/src/audit.rs:214:24: replace != with == in AuditChain::open

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace != with == in AuditChain::open
@@ -206,17 +206,17 @@
         }
         if log_len > head.len + 1 {
             return Err(AuditError::Corrupt(format!(
                 "log holds {log_len} records but head commits to {} — more than one in-flight append",
                 head.len
             )));
         }
         let prefix_hash = if head.len == 0 { [0u8; 32] } else { hash_after[head.len as usize - 1] };
-        if prefix_hash != head_hash {
+        if prefix_hash == /* ~ changed by cargo-mutants ~ */ head_hash {
             return Err(AuditError::Corrupt(format!(
                 "head hash does not match the log at length {}",
                 head.len
             )));
         }
 
         // Repair the head after an accepted crash window.
         if head.len != log_len {

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2778826) panicked at crates/mem-authz/src/audit.rs:436:41:
crash window accepted: Corrupt("head hash does not match the log at length 2")

---- audit::tests::persists_resumes_and_continues_across_reopen stdout ----

thread 'audit::tests::persists_resumes_and_continues_across_reopen' (2778832) panicked at crates/mem-authz/src/audit.rs:357:49:
reopen: Corrupt("head hash does not match the log at length 3")

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::persists_resumes_and_continues_across_reopen

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
