*** crates/mem-authz/src/audit.rs:222:21: replace != with == in AuditChain::open

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace != with == in AuditChain::open
@@ -214,17 +214,17 @@
         if prefix_hash != head_hash {
             return Err(AuditError::Corrupt(format!(
                 "head hash does not match the log at length {}",
                 head.len
             )));
         }
 
         // Repair the head after an accepted crash window.
-        if head.len != log_len {
+        if head.len == /* ~ changed by cargo-mutants ~ */ log_len {
             write_head(&head_path, log_len, &last_hash)?;
         }
 
         let log = OpenOptions::new().append(true).open(&log_path)?;
         Ok(Self {
             records,
             last_hash,
             next_seq: log_len,

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2780392) panicked at crates/mem-authz/src/audit.rs:440:9:
assertion `left == right` failed
  left: 2
 right: 3

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
