*** crates/mem-authz/src/audit.rs:237:9: replace AuditChain::log_path -> Option<&Path> with None

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace AuditChain::log_path -> Option<&Path> with None
@@ -229,17 +229,17 @@
             last_hash,
             next_seq: log_len,
             sink: Some(FileSink { log, log_path, head_path }),
         })
     }
 
     /// Path of the backing log, when persistent.
     pub fn log_path(&self) -> Option<&Path> {
-        self.sink.as_ref().map(|s| s.log_path.as_path())
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Append a record. For a persistent chain the record is durably written
     /// (log line fsync'd, head replaced) BEFORE it becomes visible in memory;
     /// on error the in-memory chain is unchanged, so callers can fail closed.
     pub fn append(
         &mut self,
         event: MemoryEvent,

---- audit::tests::log_path_is_some_for_persistent_and_none_for_in_memory stdout ----

thread 'audit::tests::log_path_is_some_for_persistent_and_none_for_in_memory' (2773731) panicked at crates/mem-authz/src/audit.rs:483:9:
assertion `left == right` failed: a persistent chain exposes its log path
  left: None
 right: Some("/var/folders/1s/3q3l6nws2g51h8l00lp0nm7h0000gn/T/memauthz-audit-logpath-88132-1781237594935109000.jsonl")

failures:
    audit::tests::log_path_is_some_for_persistent_and_none_for_in_memory

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
