*** crates/mem-authz/src/audit.rs:267:57: replace + with - in AuditChain::append

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace + with - in AuditChain::append
@@ -259,17 +259,17 @@
         };
         let hash = record_hash(&record);
         if let Some(sink) = &mut self.sink {
             let mut line = serde_json::to_vec(&record)
                 .map_err(|e| AuditError::Corrupt(format!("record serialize: {e}")))?;
             line.push(b'\n');
             sink.log.write_all(&line)?;
             sink.log.sync_data()?;
-            write_head(&sink.head_path, record.sequence + 1, &hash)?;
+            write_head(&sink.head_path, record.sequence - /* ~ changed by cargo-mutants ~ */ 1, &hash)?;
         }
         self.last_hash = hash;
         self.next_seq += 1;
         self.records.push(record);
         Ok(self.records.last().expect("just pushed"))
     }
 
     pub fn len(&self) -> usize {

---- audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired stdout ----

thread 'audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired' (2774574) panicked at crates/mem-authz/src/audit.rs:267:41:
attempt to subtract with overflow

---- audit::tests::persists_resumes_and_continues_across_reopen stdout ----

thread 'audit::tests::persists_resumes_and_continues_across_reopen' (2774580) panicked at crates/mem-authz/src/audit.rs:267:41:
attempt to subtract with overflow

---- audit::tests::tampered_log_record_is_detected_on_open stdout ----

thread 'audit::tests::tampered_log_record_is_detected_on_open' (2774581) panicked at crates/mem-authz/src/audit.rs:267:41:
attempt to subtract with overflow

failures:
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::log_more_than_one_ahead_of_head_is_rejected
    audit::tests::missing_head_sidecar_is_detected_on_open
    audit::tests::open_creates_missing_parent_directory
    audit::tests::persists_resumes_and_continues_across_reopen
    audit::tests::tampered_log_record_is_detected_on_open
    audit::tests::truncated_log_is_detected_on_open

test result: FAILED. 10 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
