*** crates/mem-authz/src/audit.rs:270:23: replace += with -= in AuditChain::append

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace += with -= in AuditChain::append
@@ -262,17 +262,17 @@
             let mut line = serde_json::to_vec(&record)
                 .map_err(|e| AuditError::Corrupt(format!("record serialize: {e}")))?;
             line.push(b'\n');
             sink.log.write_all(&line)?;
             sink.log.sync_data()?;
             write_head(&sink.head_path, record.sequence + 1, &hash)?;
         }
         self.last_hash = hash;
-        self.next_seq += 1;
+        self.next_seq -= /* ~ changed by cargo-mutants ~ */ 1;
         self.records.push(record);
         Ok(self.records.last().expect("just pushed"))
     }
 
     pub fn len(&self) -> usize {
         self.records.len()
     }

---- audit::tests::is_empty_and_len_track_records stdout ----

thread 'audit::tests::is_empty_and_len_track_records' (2777552) panicked at crates/mem-authz/src/audit.rs:270:9:
attempt to subtract with overflow

---- audit::tests::appends_and_verifies stdout ----

thread 'audit::tests::appends_and_verifies' (2777550) panicked at crates/mem-authz/src/audit.rs:270:9:
attempt to subtract with overflow

---- audit::tests::tampering_is_detected stdout ----

thread 'audit::tests::tampering_is_detected' (2777559) panicked at crates/mem-authz/src/audit.rs:270:9:
attempt to subtract with overflow

failures:
    audit::tests::appends_and_verifies
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::is_empty_and_len_track_records
    audit::tests::log_more_than_one_ahead_of_head_is_rejected
    audit::tests::missing_head_sidecar_is_detected_on_open
    audit::tests::open_creates_missing_parent_directory
    audit::tests::persists_resumes_and_continues_across_reopen
    audit::tests::tampered_log_record_is_detected_on_open
    audit::tests::tampering_is_detected
    audit::tests::truncated_log_is_detected_on_open

test result: FAILED. 7 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
