*** crates/mem-authz/src/audit.rs:284:9: replace AuditChain::records -> &[AuditRecord] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace AuditChain::records -> &[AuditRecord] with Vec::leak(Vec::new())
@@ -276,17 +276,17 @@
         self.records.len()
     }
 
     pub fn is_empty(&self) -> bool {
         self.records.is_empty()
     }
 
     pub fn records(&self) -> &[AuditRecord] {
-        &self.records
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Re-walk the chain; returns the count or the sequence where linkage breaks.
     pub fn verify_integrity(&self) -> Result<u64, String> {
         let mut expected_prev = [0u8; 32];
         for (i, r) in self.records.iter().enumerate() {
             if r.sequence != i as u64 {
                 return Err(format!("sequence break at {}", r.sequence));

---- audit::tests::appends_and_verifies stdout ----

thread 'audit::tests::appends_and_verifies' (2771585) panicked at crates/mem-authz/src/audit.rs:331:20:
index out of bounds: the len is 0 but the index is 0

---- audit::tests::persists_resumes_and_continues_across_reopen stdout ----

thread 'audit::tests::persists_resumes_and_continues_across_reopen' (2771592) panicked at crates/mem-authz/src/audit.rs:359:24:
index out of bounds: the len is 0 but the index is 2

failures:
    audit::tests::appends_and_verifies
    audit::tests::persists_resumes_and_continues_across_reopen

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
