*** crates/mem-authz/src/audit.rs:289:9: replace AuditChain::verify_integrity -> Result<u64, String> with Ok(0)

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace AuditChain::verify_integrity -> Result<u64, String> with Ok(0)
@@ -281,27 +281,17 @@
     }
 
     pub fn records(&self) -> &[AuditRecord] {
         &self.records
     }
 
     /// Re-walk the chain; returns the count or the sequence where linkage breaks.
     pub fn verify_integrity(&self) -> Result<u64, String> {
-        let mut expected_prev = [0u8; 32];
-        for (i, r) in self.records.iter().enumerate() {
-            if r.sequence != i as u64 {
-                return Err(format!("sequence break at {}", r.sequence));
-            }
-            if r.prev_hash != expected_prev {
-                return Err(format!("prev_hash break at sequence {}", r.sequence));
-            }
-            expected_prev = record_hash(r);
-        }
-        Ok(self.records.len() as u64)
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use std::time::{SystemTime, UNIX_EPOCH};

---- audit::tests::tampering_is_detected stdout ----

thread 'audit::tests::tampering_is_detected' (2777894) panicked at crates/mem-authz/src/audit.rs:332:9:
assertion failed: c.verify_integrity().is_err()

---- audit::tests::appends_and_verifies stdout ----

thread 'audit::tests::appends_and_verifies' (2777885) panicked at crates/mem-authz/src/audit.rs:320:9:
assertion `left == right` failed
  left: Ok(0)
 right: Ok(3)

---- audit::tests::persists_resumes_and_continues_across_reopen stdout ----

thread 'audit::tests::persists_resumes_and_continues_across_reopen' (2777892) panicked at crates/mem-authz/src/audit.rs:348:13:
assertion `left == right` failed
  left: Ok(0)
 right: Ok(3)

failures:
    audit::tests::appends_and_verifies
    audit::tests::crash_window_log_one_ahead_of_head_is_accepted_and_repaired
    audit::tests::persists_resumes_and_continues_across_reopen
    audit::tests::tampering_is_detected

test result: FAILED. 13 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
