*** crates/mem-authz/src/audit.rs:65:5: replace record_hash -> [u8; 32] with [1; 32]

*** mutation diff:
--- crates/mem-authz/src/audit.rs
+++ replace record_hash -> [u8; 32] with [1; 32]
@@ -57,26 +57,17 @@
     h.update(&[tag]);
     h.update(&(bytes.len() as u64).to_le_bytes());
     h.update(bytes);
 }
 
 /// blake3 over the record's fields including `sequence` and `prev_hash`, so the
 /// chain linkage is part of each hash.
 pub fn record_hash(r: &AuditRecord) -> [u8; 32] {
-    let mut h = blake3::Hasher::new();
-    feed(&mut h, 0, b"mem-authz:audit:v1");
-    feed(&mut h, 1, &r.sequence.to_le_bytes());
-    feed(&mut h, 2, &r.timestamp_ms.to_le_bytes());
-    feed(&mut h, 3, &r.prev_hash);
-    feed(&mut h, 4, format!("{:?}", r.event).as_bytes());
-    feed(&mut h, 5, r.actor.as_bytes());
-    feed(&mut h, 6, r.resource_id.as_bytes());
-    feed(&mut h, 7, r.detail.as_bytes());
-    *h.finalize().as_bytes()
+    [1; 32] /* ~ changed by cargo-mutants ~ */
 }
 
 /// `.head` sidecar payload: the chain length and last hash the log must match.
 #[derive(Serialize, Deserialize)]
 struct Head {
     len: u64,
     last_hash: String,
 }

---- audit::tests::tampering_is_detected stdout ----

thread 'audit::tests::tampering_is_detected' (2780049) panicked at crates/mem-authz/src/audit.rs:333:9:
assertion failed: c.verify_integrity().is_err()

---- audit::tests::tampered_log_record_is_detected_on_open stdout ----

thread 'audit::tests::tampered_log_record_is_detected_on_open' (2780048) panicked at crates/mem-authz/src/audit.rs:397:9:
assertion failed: matches!(AuditChain::open(&path), Err(AuditError::Corrupt(_)))

failures:
    audit::tests::tampered_log_record_is_detected_on_open
    audit::tests::tampering_is_detected

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
